app/views/discussions/_form.html.erb

        <span class="select">
          <%= f.input_field :channel_id, collection:@channels.map { |c| [c.channel, c.id] }, prompt: "Select Channel" %>
---
SELECT "channels".* FROM "channels" ORDER BY created_at desc